#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
data.cloudflare_zone.dns_zone["anyhost.ing"]: Reading...
data.cloudflare_zone.dns_zone["402.wtf"]: Reading...
aws_ses_domain_identity.domains["anyhost.ing"]: Refreshing state... [id=anyhost.ing]
aws_ses_domain_identity.domains["402.wtf"]: Refreshing state... [id=402.wtf]
aws_s3_bucket.opentofu_state: Refreshing state... [id=402-wtf-opentofu-state]
data.cloudflare_zone.dns_zone["402.wtf"]: Read complete after 1s [id=4117dfe9813eab12c73d53d52da03cf2]
data.cloudflare_zone.dns_zone["anyhost.ing"]: Read complete after 1s [id=5bd700f06bdbfa04618c390bba1be291]
aws_ses_domain_dkim.domains["402.wtf"]: Refreshing state... [id=402.wtf]
aws_ses_domain_dkim.domains["anyhost.ing"]: Refreshing state... [id=anyhost.ing]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.dkim_records[0] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - 402.wtf - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "f4hfpj7oohbrxd3v5q4gfd4omtbqiuea._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "f4hfpj7oohbrxd3v5q4gfd4omtbqiuea.dkim.amazonses.com"
      + zone_id         = "4117dfe9813eab12c73d53d52da03cf2"
    }

  # cloudflare_record.dkim_records[1] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - 402.wtf - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "qdeyfhdbjw5so4dyy44ocuxsfq45vepq._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "qdeyfhdbjw5so4dyy44ocuxsfq45vepq.dkim.amazonses.com"
      + zone_id         = "4117dfe9813eab12c73d53d52da03cf2"
    }

  # cloudflare_record.dkim_records[2] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - 402.wtf - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fnaudrcgrtobvbcrjglntdaasxvircig._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "fnaudrcgrtobvbcrjglntdaasxvircig.dkim.amazonses.com"
      + zone_id         = "4117dfe9813eab12c73d53d52da03cf2"
    }

  # cloudflare_record.dkim_records[3] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - anyhost.ing - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kvnuzrkblgapxx7xivvboosazka6vrq7._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "kvnuzrkblgapxx7xivvboosazka6vrq7.dkim.amazonses.com"
      + zone_id         = "5bd700f06bdbfa04618c390bba1be291"
    }

  # cloudflare_record.dkim_records[4] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - anyhost.ing - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gp2cmavnkpfwdjwgf4mw463clwu2bvnn._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "gp2cmavnkpfwdjwgf4mw463clwu2bvnn.dkim.amazonses.com"
      + zone_id         = "5bd700f06bdbfa04618c390bba1be291"
    }

  # cloudflare_record.dkim_records[5] will be created
  + resource "cloudflare_record" "dkim_records" {
      + allow_overwrite = false
      + comment         = "AWS SES - anyhost.ing - Managed by OpenTofu"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "44zn4vpt2w7wmdtoiomzgklai2ag46dj._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "44zn4vpt2w7wmdtoiomzgklai2ag46dj.dkim.amazonses.com"
      + zone_id         = "5bd700f06bdbfa04618c390bba1be291"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @clee231, Action: `pull_request`, Working Directory: `1_account_infra`, Workflow: `OpenTofu Plan - PR`*